In [2]:
import pandas as pd
df=pd.read_csv("weather.csv")
df

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    34          1  sunny
2  01-03-2017    23          2   snow
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain
5  01-06-2017    98          2  sunny

In [3]:
df['temp'].max()

98

In [5]:
df['day'][df['event']=='rain']

0    01-01-2017
4    01-05-2017
Name: day, dtype: object

In [6]:
df['temp'].mean()

53.5

In [7]:
df.shape

(6, 4)

In [9]:
df.columns

Index(['day', 'temp', 'windspeed', 'event'], dtype='object')

In [12]:
rows,columns=df.shape
columns

4

In [13]:
rows

6

In [14]:
df.head()

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    34          1  sunny
2  01-03-2017    23          2   snow
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain

In [15]:
df.head(3)

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    34          1  sunny
2  01-03-2017    23          2   snow

In [16]:
df.tail()

          day  temp  windspeed  event
1  01-02-2017    34          1  sunny
2  01-03-2017    23          2   snow
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain
5  01-06-2017    98          2  sunny

In [17]:
df.tail(3)

          day  temp  windspeed  event
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain
5  01-06-2017    98          2  sunny

In [18]:
df[2:5]

          day  temp  windspeed  event
2  01-03-2017    23          2   snow
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain

In [19]:
df[:]

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    34          1  sunny
2  01-03-2017    23          2   snow
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain
5  01-06-2017    98          2  sunny

In [21]:
df.day

0    01-01-2017
1    01-02-2017
2    01-03-2017
3    01-04-2017
4    01-05-2017
5    01-06-2017
Name: day, dtype: object

In [22]:
df['event']

0     rain
1    sunny
2     snow
3    snow
4     rain
5    sunny
Name: event, dtype: object

In [23]:
type(df['event'])

pandas.core.series.Series

In [25]:
df[['event','day']]

   event         day
0   rain  01-01-2017
1  sunny  01-02-2017
2   snow  01-03-2017
3  snow   01-04-2017
4   rain  01-05-2017
5  sunny  01-06-2017

In [26]:
df['temp'].std()

29.52795285826635

In [27]:
df.describe()

            temp  windspeed
count   6.000000   6.000000
mean   53.500000   3.666667
std    29.527953   2.422120
min    23.000000   1.000000
25%    32.500000   2.000000
50%    45.000000   3.000000
75%    72.500000   5.500000
max    98.000000   7.000000

In [28]:
df[df.temp>=34]

          day  temp  windspeed  event
1  01-02-2017    34          1  sunny
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain
5  01-06-2017    98          2  sunny

In [29]:
df[df.temp==df['temp'].max()]

          day  temp  windspeed  event
5  01-06-2017    98          2  sunny

In [30]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [31]:
df.set_index('day')

            temp  windspeed  event
day
01-01-2017    32          6   rain
01-02-2017    34          1  sunny
01-03-2017    23          2   snow
01-04-2017    56          7  snow
01-05-2017    78          4   rain
01-06-2017    98          2  sunny

In [32]:
df

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    34          1  sunny
2  01-03-2017    23          2   snow
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain
5  01-06-2017    98          2  sunny

In [36]:
df.loc['01-03-2017']

temp           23
windspeed       2
event        snow
Name: 01-03-2017, dtype: object

In [40]:
df.reset_index(inplace=True)

In [41]:
df

          day  temp  windspeed  event
0  01-01-2017    32          6   rain
1  01-02-2017    34          1  sunny
2  01-03-2017    23          2   snow
3  01-04-2017    56          7  snow
4  01-05-2017    78          4   rain
5  01-06-2017    98          2  sunny

In [48]:
df.reset_index(inplace=True)

In [49]:
df.set_index('event',inplace=True)

In [50]:
df.loc['snow']

day          01-03-2017
temp                 23
windspeed             2
Name: snow, dtype: object

In [51]:
df.reset_index(inplace=True)